{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_1", "claim_id": "gdpr_sample_1#1", "claim_text": "This Regulation lays down rules relating to the protection of natural persons with regard to the processing of personal data.", "source_quote": "Article 1 Subject-matter and objectives"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_1", "claim_id": "gdpr_sample_1#2", "claim_text": "This Regulation protects fundamental rights and freedoms of natural persons and in particular their right to the protection of personal data.", "source_quote": "Article 1 Subject-matter and objectives, 2."}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_1", "claim_id": "gdpr_sample_1#3", "claim_text": "The free movement of personal data within the Union shall be neither restricted nor prohibited for reasons connected with the protection of natural persons with regard to the processing of personal data.", "source_quote": "Article 1 Subject-matter and objectives, 3."}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_1", "claim_id": "gdpr_sample_1#4", "claim_text": "This Regulation applies to the processing of personal data wholly or partly by automated means and to the processing other than by automated means of personal data which form part of a filing system or are intended to form part of a filing system.", "source_quote": "Article 2 Material scope, 1."}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_1", "claim_id": "gdpr_sample_1#5", "claim_text": "This Regulation does not apply to the processing of personal data: (a) in the course of an activity which falls outside the scope of Union law;", "source_quote": "Article 2 Material scope, 2.(a)"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_1", "claim_id": "gdpr_sample_1#6", "claim_text": "This Regulation does not apply to the processing of personal data: (b) by the Member States when carrying out activities which fall within the scope of Chapter 2 of Title V of the TEU;", "source_quote": "Article 2 Material scope, 2.(b)"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_1", "claim_id": "gdpr_sample_1#7", "claim_text": "This Regulation does not apply to the processing of personal data: (c) by a natural person in the course of a purely personal or household activity;", "source_quote": "Article 2 Material scope, 2.(c)"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_1", "claim_id": "gdpr_sample_1#8", "claim_text": "This Regulation does not apply to the processing of personal data: (d) by competent authorities for the purposes of the prevention, investigation, detection or prosecution of criminal offences or the execution of criminal penalties, including the safeguarding against and the prevention of threats to public security.", "source_quote": "Article 2 Material scope, 2.(d)"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_2", "claim_id": "gdpr_sample_2#1", "claim_text": "Regulation (EC) No 45/2001 applies for the processing of personal data by Union institutions, bodies, offices, and agencies.", "source_quote": "For the processing of personal data by the Union institutions, bodies, offices and agencies, Regulation (EC) No 45/2001 applies."}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_2", "claim_id": "gdpr_sample_2#2", "claim_text": "Regulation (EC) No 45/2001 will be adapted to the principles and rules of this General Data Protection Regulation.", "source_quote": "Regulation (EC) No 45/2001 and other Union legal acts applicable to such processing of personal data shall be adapted to the principles and rules of this General Data Protection Regulation"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_3", "claim_id": "gdpr_sample_3#1", "claim_text": "Personal data shall be processed lawfully.", "source_quote": "processed lawfully"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_3", "claim_id": "gdpr_sample_3#2", "claim_text": "Personal data shall be collected for specified, explicit and legitimate purposes.", "source_quote": "collected for specified, explicit and legitimate purposes"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_3", "claim_id": "gdpr_sample_3#3", "claim_text": "Further processing is not incompatible with the initial purposes if it's for archiving purposes in the public interest, scientific or historical research purposes or statistical purposes.", "source_quote": "further processing for archiving purposes in the public interest, scientific or historical research purposes or statistical purposes shall"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_3", "claim_id": "gdpr_sample_3#4", "claim_text": "Personal data shall be adequate, relevant and limited to what is necessary.", "source_quote": "adequate, relevant and limited to what is necessary"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_3", "claim_id": "gdpr_sample_3#5", "claim_text": "Personal data shall be accurate and kept up to date.", "source_quote": "accurate and, where necessary, kept up to date"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_3", "claim_id": "gdpr_sample_3#6", "claim_text": "Inaccurate personal data must be erased or rectified without delay.", "source_quote": "every reasonable step must be taken to ensure that personal data that are inaccurate, having regard to the purposes for which they are processed, are erased or rectified without delay"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_3", "claim_id": "gdpr_sample_3#7", "claim_text": "Personal data shall be kept in a form which permits identification of data subjects for no longer than is necessary.", "source_quote": "kept in a form which permits identification of data subjects for no longer than is necessary"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_3", "claim_id": "gdpr_sample_3#8", "claim_text": "Personal data may be stored for longer periods if it's solely for archiving purposes in the public interest, scientific or historical research purposes or statistical purposes.", "source_quote": "personal data may be stored for longer periods insofar as the personal data will be processed solely for archiving purposes in the public interest, scientific or historical research purposes or statistical purposes"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_3", "claim_id": "gdpr_sample_3#9", "claim_text": "Personal data shall be processed to ensure appropriate security.", "source_quote": "processed in a manner that ensures appropriate security of the personal data"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_4", "claim_id": "gdpr_sample_4#1", "claim_text": "Personal data shall be processed lawfully.", "source_quote": "processed lawfully"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_4", "claim_id": "gdpr_sample_4#2", "claim_text": "Personal data shall be processed fairly.", "source_quote": "processed lawfully, fairly"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_4", "claim_id": "gdpr_sample_4#3", "claim_text": "Personal data shall be processed in a transparent manner.", "source_quote": "in a transparent manner"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_4", "claim_id": "gdpr_sample_4#4", "claim_text": "Data shall be collected for specified, explicit and legitimate purposes.", "source_quote": "collected for specified, explicit and legitimate purposes"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_4", "claim_id": "gdpr_sample_4#5", "claim_text": "Further processing is not incompatible with the initial purposes if it's for archiving, scientific or historical research, or statistical purposes.", "source_quote": "further processing for archiving purposes in the public interest, scientific or historical research purposes or statistical purposes shall, in accordance with Article 89(1), not be considered to be incompatible with the initial purposes"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_4", "claim_id": "gdpr_sample_4#6", "claim_text": "Data minimisation requires that data is adequate, relevant and limited to what is necessary.", "source_quote": "adequate, relevant and limited to what is necessary"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_4", "claim_id": "gdpr_sample_4#7", "claim_text": "Personal data must be accurate and kept up to date.", "source_quote": "accurate and, where necessary, kept up to date"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_4", "claim_id": "gdpr_sample_4#8", "claim_text": "Inaccurate personal data must be erased or rectified without delay.", "source_quote": "every reasonable step must be taken to ensure that personal data that are inaccurate, having regard to the purposes for which they are processed, are erased or rectified without delay"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_4", "claim_id": "gdpr_sample_4#9", "claim_text": "Personal data shall be stored in a form permitting identification of data subjects for no longer than necessary.", "source_quote": "kept in a form which permits identification of data subjects for no longer than is necessary"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_4", "claim_id": "gdpr_sample_4#10", "claim_text": "Personal data may be stored for longer periods if it's solely for archiving, scientific or historical research, or statistical purposes.", "source_quote": "personal data may be stored for longer periods insofar as the personal data will be processed solely for archiving purposes in the public interest, scientific or historical research purposes or statistical purposes"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_4", "claim_id": "gdpr_sample_4#11", "claim_text": "Personal data shall be processed to ensure appropriate security and integrity.", "source_quote": "processed in a manner that ensures appropriate security of the personal data, including protection against unauthorised or unlawful processing and against accidental loss, destruction or damage"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_5", "claim_id": "gdpr_sample_5#1", "claim_text": "Processing is necessary for the performance of a contract to which the data subject is party.", "source_quote": "(b) processing is necessary for the performance of a contract"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_5", "claim_id": "gdpr_sample_5#2", "claim_text": "Processing is necessary in order to take steps at the request of the data subject prior to entering into a contract.", "source_quote": "(b) processing is necessary to take steps at the request of the data subject prior to entering into a contract"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_5", "claim_id": "gdpr_sample_5#3", "claim_text": "Processing is necessary for compliance with a legal obligation to which the controller is subject.", "source_quote": "(c) processing is necessary for compliance with a legal obligation"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_5", "claim_id": "gdpr_sample_5#4", "claim_text": "Processing is necessary to protect the vital interests of the data subject or of another natural person.", "source_quote": "(d) processing is necessary in order to protect the vital interests"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_5", "claim_id": "gdpr_sample_5#5", "claim_text": "Processing is necessary for the performance of a task carried out in the public interest or in the exercise of official authority vested in the controller.", "source_quote": "(e) processing is necessary for the performance of a task carried out in the public interest"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_5", "claim_id": "gdpr_sample_5#6", "claim_text": "Processing is necessary for the purposes of the legitimate interests pursued by the controller or by a third party, except where such interests are overridden by the interests or fundamental rights and freedoms of the data subject which require protection of personal data.", "source_quote": "(f) processing is necessary for the purposes of the legitimate interests"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_6", "claim_id": "gdpr_sample_6#1", "claim_text": "The basis for the processing referred to in point (c) and (e) of paragraph 1 shall be laid down by Union law or Member State law.", "source_quote": "shall be laid down by: (a) Union law; or (b) Member State law"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_6", "claim_id": "gdpr_sample_6#2", "claim_text": "The purpose of the processing shall be determined in that legal basis.", "source_quote": "The purpose of the processing shall be determined in that legal basis"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_6", "claim_id": "gdpr_sample_6#3", "claim_text": "That legal basis may contain specific provisions to adapt the application of rules of this Regulation.", "source_quote": "That legal basis may contain specific provisions to adapt the application of rules of this Regulation"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_6", "claim_id": "gdpr_sample_6#4", "claim_text": "The Union or the Member State law shall meet an objective of public interest and be proportionate to the legitimate aim pursued.", "source_quote": "The Union or the Member State law shall meet an objective of public interest and be proportionate to the legitimate aim pursued"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_7", "claim_id": "gdpr_sample_7#1", "claim_text": "The controller shall take into account any link between the purposes for which the personal data have been collected and the purposes of the intended further processing.", "source_quote": "the controller shall, in order to ascertain whether processing for another purpose is compatible with the purpose for which the personal data are initially collected, take into account, inter alia:"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_7", "claim_id": "gdpr_sample_7#2", "claim_text": "The context in which the personal data have been collected is relevant when determining compatibility.", "source_quote": "the context in which the personal data have been collected, in particular regarding the relationship between data subjects and the controller;"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_7", "claim_id": "gdpr_sample_7#3", "claim_text": "Special categories of personal data are processed differently than other types of personal data.", "source_quote": "whether special categories of personal data are processed, pursuant to Article 9"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_7", "claim_id": "gdpr_sample_7#4", "claim_text": "Personal data related to criminal convictions and offences are processed differently than other types of personal data.", "source_quote": "whether personal data related to criminal convictions and offences are processed, pursuant to Article 10"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_8", "claim_id": "gdpr_sample_8#1", "claim_text": "The controller shall be able to demonstrate that the data subject has consented to processing of his or her personal data.", "source_quote": "Where processing is based on consent, the controller shall be able to demonstrate that the data subject has consented to processing of his or her personal data."}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_8", "claim_id": "gdpr_sample_8#2", "claim_text": "The request for consent shall be presented in a manner which is clearly distinguishable from other matters.", "source_quote": "If the data subject's consent is given in the context of a written declaration which also concerns other matters, the request for consent shall be presented in a manner which is clearly distinguishable from the other matters"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_8", "claim_id": "gdpr_sample_8#3", "claim_text": "The withdrawal of consent shall not affect the lawfulness of processing based on consent before its withdrawal.", "source_quote": "The data subject shall have the right to withdraw his or her consent at any time. The withdrawal of consent shall not affect the lawfulness of processing based on consent before its withdrawal."}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_8", "claim_id": "gdpr_sample_8#4", "claim_text": "Prior to giving consent, the data subject shall be informed thereof.", "source_quote": "It shall be as easy to withdraw as to give consent. Prior to giving consent, the data subject shall be informed thereof."}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_8", "claim_id": "gdpr_sample_8#5", "claim_text": "The child's processing of personal data is lawful only if and to the extent that consent is given or authorised by the holder of parental responsibility over the child.", "source_quote": "Where the child is below the age of 16 years, such processing shall be lawful only if and to the extent that consent is given or authorised by the holder of parental responsibility over the child."}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_8", "claim_id": "gdpr_sample_8#6", "claim_text": "Processing of certain personal data shall be prohibited.", "source_quote": "Processing of personal data revealing racial or ethnic origin, political opinions, religious or philosophical beliefs, or trade union membership, and the processing of genetic data, biometric data for the purpose of uniquely identifying a natural person, data concerning health or data concerning a natural person's sex life or sexual orientation shall be prohibited."}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_8", "claim_id": "gdpr_sample_8#7", "claim_text": "The prohibition on processing certain personal data may not be lifted by the data subject.", "source_quote": "(a) the data subject has given explicit consent to the processing of those personal data for one or more specified purposes, except where Union or Member State law provide that the prohibition referred to in paragraph 1 may not be lifted by the data subject;"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_8", "claim_id": "gdpr_sample_8#8", "claim_text": "Processing is necessary for the performance of a task carried out by a controller in the public interest.", "source_quote": "(b) processing is necessary for the performance of a task carried out by a controller in the public interest or in the exercise of official authority vested in the controller."}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_9", "claim_id": "gdpr_sample_9#1", "claim_text": "The controller shall take into account any link between the purposes for which personal data have been collected and the purposes of intended further processing.", "source_quote": "the controller shall, in order to ascertain whether processing for another purpose is compatible with the purpose for which the personal data are initially collected, take into account, inter alia:"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_9", "claim_id": "gdpr_sample_9#2", "claim_text": "The controller shall consider the context in which personal data have been collected.", "source_quote": "the context in which the personal data have been collected, in particular regarding the relationship between data subjects and the controller;"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_9", "claim_id": "gdpr_sample_9#3", "claim_text": "The controller shall assess whether special categories of personal data are processed.", "source_quote": "whether special categories of personal data are processed, pursuant to Article 9"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_9", "claim_id": "gdpr_sample_9#4", "claim_text": "The controller shall consider the nature of the personal data.", "source_quote": "the nature of the personal data, in particular whether special categories of personal data are processed, pursuant to Article 9"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_9", "claim_id": "gdpr_sample_9#5", "claim_text": "The controller shall evaluate possible consequences for data subjects.", "source_quote": "the possible consequences of the intended further processing for data subjects;"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_9", "claim_id": "gdpr_sample_9#6", "claim_text": "The controller shall consider the existence of appropriate safeguards.", "source_quote": "the existence of appropriate safeguards, which may include encryption or pseudonymisation"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_9", "claim_id": "gdpr_sample_9#7", "claim_text": "A controller must be able to demonstrate that a data subject has consented to processing their personal data.", "source_quote": "the controller shall be able to demonstrate that the data subject has consented to processing of his or her personal data."}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_9", "claim_id": "gdpr_sample_9#8", "claim_text": "Consent requests must be presented in a clear and intelligible form.", "source_quote": "in an intelligible and easily accessible form, using clear and plain language"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_9", "claim_id": "gdpr_sample_9#9", "claim_text": "Children under 16 require parental consent for processing their personal data.", "source_quote": "the processing of the personal data of a child shall be lawful only if and to the extent that consent is given or authorised by the holder of parental responsibility over the child."}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_9", "claim_id": "gdpr_sample_9#10", "claim_text": "Processing special categories of personal data is generally prohibited.", "source_quote": "Processing of personal data revealing racial or ethnic origin, political opinions, religious or philosophical beliefs, or trade union membership, and the processing of genetic data, biometric data for the purpose of uniquely identifying a natural person, data concerning health or data concerning a natural person's sex life or sexual orientation shall be prohibited."}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_10", "claim_id": "gdpr_sample_10#1", "claim_text": "Processing of genetic data shall be prohibited.", "source_quote": "Processing of genetic data"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_10", "claim_id": "gdpr_sample_10#2", "claim_text": "Processing of biometric data for the purpose of uniquely identifying a natural person shall be prohibited.", "source_quote": "biometric data for the purpose of uniquely identifying a natural person"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_10", "claim_id": "gdpr_sample_10#3", "claim_text": "Processing of data concerning health shall be prohibited.", "source_quote": "data concerning health"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_10", "claim_id": "gdpr_sample_10#4", "claim_text": "Processing of data concerning a natural person's sex life or sexual orientation shall be prohibited.", "source_quote": "data concerning a natural person's sex life or sexual orientation"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_11", "claim_id": "gdpr_sample_11#1", "claim_text": "processing relates to personal data which are manifestly made public by the data subject", "source_quote": "(e) processing relates to personal data which are manifestly made public by the data subject"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_11", "claim_id": "gdpr_sample_11#2", "claim_text": "processing is necessary for the establishment, exercise or defence of legal claims", "source_quote": "(f) processing is necessary for the establishment, exercise or defence of legal claims"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_11", "claim_id": "gdpr_sample_11#3", "claim_text": "processing is necessary for reasons of substantial public interest on the basis of Union or Member State law", "source_quote": "(g) processing is necessary for reasons of substantial public interest, on the basis of Union or Member State law"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_11", "claim_id": "gdpr_sample_11#4", "claim_text": "processing is necessary for the purposes of preventive or occupational medicine", "source_quote": "(h) processing is necessary for the purposes of preventive or occupational medicine"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_11", "claim_id": "gdpr_sample_11#5", "claim_text": "processing is necessary for reasons of public interest in the area of public health", "source_quote": "(i) processing is necessary for reasons of public interest in the area of public health"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_11", "claim_id": "gdpr_sample_11#6", "claim_text": "processing is necessary for archiving purposes, scientific or historical research purposes, or statistical purposes", "source_quote": "(j) processing is necessary for archiving purposes in the public interest, scientific or historical research purposes or statistical purposes"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_12", "claim_id": "gdpr_sample_12#1", "claim_text": "Processing is necessary for the purposes of carrying out obligations and exercising specific rights in employment and social security law.", "source_quote": "processing is necessary for the purposes of carrying out the obligations and exercising specific rights of the controller or of the data subject in the field of employment and social security and social protection law"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_12", "claim_id": "gdpr_sample_12#2", "claim_text": "Processing is necessary to protect vital interests where the data subject is physically or legally incapable of giving consent.", "source_quote": "processing is carried out to protect the vital interests of the data subject or of another natural person where the data subject is physically or legally incapable of giving consent"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_12", "claim_id": "gdpr_sample_12#3", "claim_text": "Processing relates solely to members, former members, or those with regular contact with a not-for-profit body.", "source_quote": "processing relates solely to the members or to former members of the body or to persons who have regular contact with it in connection with its purposes"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_12", "claim_id": "gdpr_sample_12#4", "claim_text": "Processing is necessary for the establishment, exercise, or defence of legal claims.", "source_quote": "processing is necessary for the establishment, exercise or defence of legal claims"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_12", "claim_id": "gdpr_sample_12#5", "claim_text": "Processing is necessary for reasons of substantial public interest on the basis of Union or Member State law.", "source_quote": "processing is necessary for reasons of substantial public interest, on the basis of Union or Member State law which shall be proportionate to the aim pursued"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_12", "claim_id": "gdpr_sample_12#6", "claim_text": "Processing is necessary for preventive or occupational medicine, medical diagnosis, health care, or treatment.", "source_quote": "processing is necessary for the purposes of preventive or occupational medicine, for the assessment of the working capacity of the employee, medical diagnosis, the provision of health or social care or treatment"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_12", "claim_id": "gdpr_sample_12#7", "claim_text": "Processing is necessary for public interest in public health on the basis of Union or Member State law.", "source_quote": "processing is necessary for reasons of public interest in the area of public health, such as protecting against serious cross-border threats to health"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_12", "claim_id": "gdpr_sample_12#8", "claim_text": "Processing is necessary for archiving purposes, scientific research, historical research, or statistical purposes on the basis of official authority.", "source_quote": "processing is necessary for archiving purposes in the public interest, scientific or historical research purposes or statistical purposes in accordance with Article 89(1) based on official authority"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_12", "claim_id": "gdpr_sample_12#9", "claim_text": "Controllers do not need to maintain, acquire, or process additional information if the purposes do not require identification.", "source_quote": "the controller shall not be obliged to maintain, acquire or process additional information in order to identify the data subject for the sole purpose of complying with this Regulation"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_12", "claim_id": "gdpr_sample_12#10", "claim_text": "Controllers must inform data subjects if they are unable to identify them and provide additional information enabling identification.", "source_quote": "the controller shall inform the data subject accordingly, if possible. In such cases, Articles 15 to 20 shall not apply except where the data subject, for the purpose of exercising his or her rights under those articles, provides additional information enabling his or her identification"}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_13", "claim_id": "gdpr_sample_13#1", "claim_text": "Processing of personal data relating to criminal convictions and offences or related security measures shall be carried out only under the control of official authority or when the processing is authorised by Union or Member State law.", "source_quote": "Processing of personal data relating to criminal convictions and offences or related security measures based on Article 6(1) shall be carried out only under the control of official authority or when the processing is authorised by Union or Member State law providing for appropriate safeguards for the rights and freedoms of data subjects."}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_13", "claim_id": "gdpr_sample_13#2", "claim_text": "Any comprehensive register of criminal convictions shall be kept only under the control of official authority.", "source_quote": "Any comprehensive register of criminal convictions shall be kept only under the control of official authority."}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_13", "claim_id": "gdpr_sample_13#3", "claim_text": "If the purposes for which a controller processes personal data do not or do no longer require the identification of a data subject by the controller, the controller shall not be obliged to maintain, acquire or process additional information.", "source_quote": "1. If the purposes for which a controller processes personal data do not or do no longer require the identification of a data subject by the controller, the controller shall not be obliged to maintain, acquire or process additional information in order to identify the data subject for the sole purpose of complying with this Regulation."}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_13", "claim_id": "gdpr_sample_13#4", "claim_text": "Where the controller is able to demonstrate that it is not in a position to identify the data subject, the controller shall inform the data subject accordingly, if possible.", "source_quote": "2. Where, in cases referred to in paragraph 1 of this Article, the controller is able to demonstrate that it is not in a position to identify the data subject, the controller shall inform the data subject accordingly, if possible."}
{"doc": "gdpr_sample", "chunk_id": "gdpr_sample_13", "claim_id": "gdpr_sample_13#5", "claim_text": "In such cases, Articles 15 to 20 shall not apply except where the data subject, for the purpose of exercising his or her rights under those articles, provides additional information enabling his or her identification.", "source_quote": "In such cases, Articles 15 to 20 shall not apply except where the data subject, for the purpose of exercising his or her rights under those articles, provides additional information enabling his or her identification"}
