{"doc": "gdpr13", "chunk_id": "gdpr13_1", "claim_id": "gdpr13_1#1", "claim_text": "This Regulation lays down rules relating to the protection of natural persons with regard to the processing of personal data.", "source_quote": "This Regulation lays down rules"}
{"doc": "gdpr13", "chunk_id": "gdpr13_1", "claim_id": "gdpr13_1#2", "claim_text": "The free movement of personal data within the Union shall be neither restricted nor prohibited for reasons connected with the protection of natural persons with regard to the processing of personal data.", "source_quote": "The free movement of personal data within the Union shall be neither restricted nor prohibited"}
{"doc": "gdpr13", "chunk_id": "gdpr13_1", "claim_id": "gdpr13_1#3", "claim_text": "This Regulation applies to the processing of personal data wholly or partly by automated means and to the processing other than by automated means of personal data which form part of a filing system or are intended to form part of a filing system.", "source_quote": "This Regulation applies to the processing"}
{"doc": "gdpr13", "chunk_id": "gdpr13_1", "claim_id": "gdpr13_1#4", "claim_text": "It does not apply to the processing of personal data: (a) in the course of an activity which falls outside the scope of Union law;", "source_quote": "(a) in the course of an activity which falls outside the scope of Union law;"}
{"doc": "gdpr13", "chunk_id": "gdpr13_2", "claim_id": "gdpr13_2#1", "claim_text": "The General Data Protection Regulation does not apply to the processing of personal data by competent authorities for the purposes of the prevention, investigation, detection or prosecution of criminal offences or the execution of criminal penalties.", "source_quote": "The General Data Protection Regulation does not apply"}
{"doc": "gdpr13", "chunk_id": "gdpr13_2", "claim_id": "gdpr13_2#2", "claim_text": "Regulation (EC) No 45/2001 applies to the processing of personal data by the Union institutions, bodies, offices and agencies.", "source_quote": "For the processing of personal data by the Union institutions, bodies, offices and agencies, Regulation (EC) No 45/2001 applies"}
{"doc": "gdpr13", "chunk_id": "gdpr13_2", "claim_id": "gdpr13_2#3", "claim_text": "Regulation (EC) No 45/2001 and other Union legal acts applicable to such processing of personal data shall be adapted to the principles and rules of this Regulation.", "source_quote": "Regulation (EC) No 45/2001 and other Union legal acts applicable to such processing of personal data shall be adapted"}
{"doc": "gdpr13", "chunk_id": "gdpr13_2", "claim_id": "gdpr13_2#4", "claim_text": "This Regulation shall be without prejudice to the application of Directive 2000/31/EC, in particular of the liability rules of intermediary service providers in Articles 12 to 15 of that Directive.", "source_quote": "This Regulation shall be without prejudice to the application of Directive 2000/31/EC"}
{"doc": "gdpr13", "chunk_id": "gdpr13_3", "claim_id": "gdpr13_3#1", "claim_text": "The General Data Protection Regulation applies to the processing of personal data by a controller or processor in the context of their activities within the Union.", "source_quote": "The General Data Protection Regulation applies to the processing of personal data by a controller or processor"}
{"doc": "gdpr13", "chunk_id": "gdpr13_3", "claim_id": "gdpr13_3#2", "claim_text": "This Regulation also applies to the processing of personal data of data subjects who are in the Union by a controller or processor not established in the Union, where the processing activities are related to the offering of goods or services, or the monitoring of their behaviour as far as their behaviour takes place within the Union.", "source_quote": ""}
{"doc": "gdpr13", "chunk_id": "gdpr13_4", "claim_id": "gdpr13_4#1", "claim_text": "Personal data shall be processed lawfully.", "source_quote": "processed lawfully"}
{"doc": "gdpr13", "chunk_id": "gdpr13_4", "claim_id": "gdpr13_4#2", "claim_text": "Personal data shall be processed fairly.", "source_quote": "fairly and in a transparent manner"}
{"doc": "gdpr13", "chunk_id": "gdpr13_4", "claim_id": "gdpr13_4#3", "claim_text": "Personal data shall be processed transparently.", "source_quote": "in a transparent manner"}
{"doc": "gdpr13", "chunk_id": "gdpr13_4", "claim_id": "gdpr13_4#4", "claim_text": "Data shall be collected for specified, explicit, and legitimate purposes.", "source_quote": "collected for specified, explicit and legitimate purposes"}
{"doc": "gdpr13", "chunk_id": "gdpr13_4", "claim_id": "gdpr13_4#5", "claim_text": "Further processing is not incompatible with the initial purposes if it's for archiving, scientific or historical research, or statistical purposes.", "source_quote": "further processing for archiving purposes in the public interest, scientific or historical research purposes or statistical purposes shall, in accordance with Article 89(1), not be considered to be incompatible with the initial purposes"}
{"doc": "gdpr13", "chunk_id": "gdpr13_4", "claim_id": "gdpr13_4#6", "claim_text": "Data minimisation requires that data is adequate, relevant, and limited to what's necessary.", "source_quote": "adequate, relevant and limited to what is necessary"}
{"doc": "gdpr13", "chunk_id": "gdpr13_4", "claim_id": "gdpr13_4#7", "claim_text": "Personal data should be accurate and kept up-to-date.", "source_quote": "accurate and, where necessary, kept up to date"}
{"doc": "gdpr13", "chunk_id": "gdpr13_4", "claim_id": "gdpr13_4#8", "claim_text": "Inaccurate personal data must be erased or rectified without delay.", "source_quote": "every reasonable step must be taken to ensure that personal data that are inaccurate, having regard to the purposes for which they are processed, are erased or rectified without delay"}
{"doc": "gdpr13", "chunk_id": "gdpr13_4", "claim_id": "gdpr13_4#9", "claim_text": "Personal data should be stored in a form permitting identification of data subjects for no longer than necessary.", "source_quote": "kept in a form which permits identification of data subjects for no longer than is necessary"}
{"doc": "gdpr13", "chunk_id": "gdpr13_4", "claim_id": "gdpr13_4#10", "claim_text": "Personal data may be stored for longer periods if it's solely for archiving, scientific or historical research, or statistical purposes.", "source_quote": "personal data may be stored for longer periods insofar as the personal data will be processed solely for archiving purposes in the public interest, scientific or historical research purposes or statistical purposes"}
{"doc": "gdpr13", "chunk_id": "gdpr13_4", "claim_id": "gdpr13_4#11", "claim_text": "Personal data should be processed to ensure appropriate security and integrity.", "source_quote": "processed in a manner that ensures appropriate security of the personal data, including protection against unauthorised or unlawful processing and against accidental loss, destruction or damage"}
{"doc": "gdpr13", "chunk_id": "gdpr13_5", "claim_id": "gdpr13_5#1", "claim_text": "Processing shall be lawful only if and to the extent that at least one of the following applies.", "source_quote": "Processing shall be lawful only if and to the extent that at least one of the following applies:"}
{"doc": "gdpr13", "chunk_id": "gdpr13_5", "claim_id": "gdpr13_5#2", "claim_text": "The data subject has given consent to the processing of his or her personal data for one or more specific purposes.", "source_quote": "(a) the data subject has given consent to the processing of his or her personal data for one or more specific purposes;"}
{"doc": "gdpr13", "chunk_id": "gdpr13_5", "claim_id": "gdpr13_5#3", "claim_text": "Processing is necessary for the performance of a contract to which the data subject is party or in order to take steps at the request of the data subject prior to entering into a contract.", "source_quote": "(b) processing is necessary for the performance of a contract to which the data subject is party or in order to take steps at the request of the data subject prior to entering into a contract;"}
{"doc": "gdpr13", "chunk_id": "gdpr13_5", "claim_id": "gdpr13_5#4", "claim_text": "Processing is necessary for compliance with a legal obligation to which the controller is subject.", "source_quote": "(c) processing is necessary for compliance with a legal obligation to which the controller is subject;"}
{"doc": "gdpr13", "chunk_id": "gdpr13_5", "claim_id": "gdpr13_5#5", "claim_text": "Processing is necessary in order to protect the vital interests of the data subject or of another natural person.", "source_quote": "(d) processing is necessary in order to protect the vital interests of the data subject or of another natural person;"}
{"doc": "gdpr13", "chunk_id": "gdpr13_5", "claim_id": "gdpr13_5#6", "claim_text": "Processing is necessary for the performance of a task carried out in the public interest or in the exercise of official authority vested in the controller.", "source_quote": "(e) processing is necessary for the performance of a task carried out in the public interest or in the exercise of official authority vested in the controller;"}
{"doc": "gdpr13", "chunk_id": "gdpr13_5", "claim_id": "gdpr13_5#7", "claim_text": "Processing is necessary for the purposes of the legitimate interests pursued by the controller or by a third party, except where such interests are overridden by the interests or fundamental rights and freedoms of the data subject which require protection of personal data, in particular where the data subject is a child.", "source_quote": "(f) processing is necessary for the purposes of the legitimate interests pursued by the controller or by a third party, except where such interests are overridden by the interests or fundamental rights and freedoms of the data subject which require protection of personal data, in particular where the data subject is a child."}
{"doc": "gdpr13", "chunk_id": "gdpr13_5", "claim_id": "gdpr13_5#8", "claim_text": "The basis for the processing referred to in point (c) and (e) of paragraph 1 shall be laid down by Union law; or Member State law to which the controller is subject.", "source_quote": "2. The basis for the processing referred to in point (c) and (e) of paragraph 1 shall be laid down by: (a) Union law; or (b) Member State law to which the controller is subject."}
{"doc": "gdpr13", "chunk_id": "gdpr13_5", "claim_id": "gdpr13_5#9", "claim_text": "The purpose of the processing shall be determined in that legal basis or, as regards the processing referred to in point (e) of paragraph 1, shall be necessary for the performance of a task carried out in the public interest or in the exercise of official authority vested in the controller.", "source_quote": "3. The purpose of the processing shall be determined in that legal basis or, as regards the processing referred to in point (e) of paragraph 1, shall be necessary for the performance of a task carried out in the public interest or in the exercise of official authority vested in the controller."}
{"doc": "gdpr13", "chunk_id": "gdpr13_6", "claim_id": "gdpr13_6#1", "claim_text": "The controller shall ensure lawful and fair processing.", "source_quote": "The controller shall be responsible for ensuring lawful and fair processing"}
{"doc": "gdpr13", "chunk_id": "gdpr13_6", "claim_id": "gdpr13_6#2", "claim_text": "The basis for processing referred to in point (c) and (e) of paragraph 1 shall be laid down by Union law or Member State law.", "source_quote": "The basis for the processing referred to in point (c) and (e) of paragraph 1 shall be laid down by: (a) Union law; or (b) Member State law to which the controller is subject"}
{"doc": "gdpr13", "chunk_id": "gdpr13_6", "claim_id": "gdpr13_6#3", "claim_text": "The purpose of processing shall be determined in that legal basis.", "source_quote": "The purpose of the processing shall be determined in that legal basis"}
{"doc": "gdpr13", "chunk_id": "gdpr13_6", "claim_id": "gdpr13_6#4", "claim_text": "Processing may be necessary for the performance of a task carried out in the public interest or in the exercise of official authority vested in the controller.", "source_quote": "as regards the processing referred to in point (e) of paragraph 1, shall be necessary for the performance of a task carried out in the public interest or in the exercise of official authority vested in the controller"}
{"doc": "gdpr13", "chunk_id": "gdpr13_6", "claim_id": "gdpr13_6#5", "claim_text": "The legal basis may contain specific provisions.", "source_quote": "That legal basis may contain specific provisions to adapt the application of rules of this Regulation"}
{"doc": "gdpr13", "chunk_id": "gdpr13_7", "claim_id": "gdpr13_7#1", "claim_text": "The controller shall process personal data for a purpose other than that for which they were collected.", "source_quote": "processing personal data for a purpose other than that for which they were collected"}
{"doc": "gdpr13", "chunk_id": "gdpr13_7", "claim_id": "gdpr13_7#2", "claim_text": "When processing, the controller shall take into account any link between the purposes.", "source_quote": "take into account any link between the purposes"}
{"doc": "gdpr13", "chunk_id": "gdpr13_7", "claim_id": "gdpr13_7#3", "claim_text": "The context of collection is a factor to consider when processing personal data.", "source_quote": "the context of collection"}
{"doc": "gdpr13", "chunk_id": "gdpr13_7", "claim_id": "gdpr13_7#4", "claim_text": "The nature of the data is a consideration for the controller when processing.", "source_quote": "the nature of the data"}
{"doc": "gdpr13", "chunk_id": "gdpr13_7", "claim_id": "gdpr13_7#5", "claim_text": "Possible consequences are a factor to consider when processing personal data.", "source_quote": "possible consequences"}
{"doc": "gdpr13", "chunk_id": "gdpr13_7", "claim_id": "gdpr13_7#6", "claim_text": "The existence of appropriate safeguards is a consideration for the controller when processing personal data.", "source_quote": "existence of appropriate safeguards"}
{"doc": "gdpr13", "chunk_id": "gdpr13_7", "claim_id": "gdpr13_7#7", "claim_text": "Special categories of personal data may be processed.", "source_quote": "special categories of personal data are processed"}
{"doc": "gdpr13", "chunk_id": "gdpr13_7", "claim_id": "gdpr13_7#8", "claim_text": "Personal data related to criminal convictions and offences may be processed.", "source_quote": "personal data related to criminal convictions and offences are processed"}
{"doc": "gdpr13", "chunk_id": "gdpr13_8", "claim_id": "gdpr13_8#1", "claim_text": "The controller must be able to demonstrate that a data subject has consented to processing of their personal data.", "source_quote": "Where processing is based on consent, the controller shall be able to demonstrate that the data subject has consented to processing of his or her personal data."}
{"doc": "gdpr13", "chunk_id": "gdpr13_8", "claim_id": "gdpr13_8#2", "claim_text": "Consent requests must be presented in a clear and intelligible form using plain language.", "source_quote": "the request for consent shall be presented in a manner which is clearly distinguishable from the other matters, in an intelligible and easily accessible form, using clear and plain language."}
{"doc": "gdpr13", "chunk_id": "gdpr13_8", "claim_id": "gdpr13_8#3", "claim_text": "The data subject has the right to withdraw their consent at any time.", "source_quote": "The data subject shall have the right to withdraw his or her consent at any time."}
{"doc": "gdpr13", "chunk_id": "gdpr13_8", "claim_id": "gdpr13_8#4", "claim_text": "Withdrawal of consent does not affect the lawfulness of processing based on consent before withdrawal.", "source_quote": "The withdrawal of consent shall not affect the lawfulness of processing based on consent before its withdrawal."}
{"doc": "gdpr13", "chunk_id": "gdpr13_8", "claim_id": "gdpr13_8#5", "claim_text": "Data subjects must be informed that they can withdraw their consent prior to giving consent.", "source_quote": "Prior to giving consent, the data subject shall be informed thereof."}
{"doc": "gdpr13", "chunk_id": "gdpr13_8", "claim_id": "gdpr13_8#6", "claim_text": "It should be as easy to withdraw consent as it is to give consent.", "source_quote": "It shall be as easy to withdraw as to give consent."}
{"doc": "gdpr13", "chunk_id": "gdpr13_9", "claim_id": "gdpr13_9#1", "claim_text": "The controller shall take into account any link between the purposes for which the personal data have been collected and the purposes of the intended further processing.", "source_quote": "the controller shall, in order to ascertain whether processing for another purpose is compatible with the purpose for which the personal data are initially collected,"}
{"doc": "gdpr13", "chunk_id": "gdpr13_9", "claim_id": "gdpr13_9#2", "claim_text": "The context in which the personal data have been collected is a factor to consider when determining compatibility.", "source_quote": "the context in which the personal data have been collected, in particular regarding the relationship between data subjects and the controller;"}
{"doc": "gdpr13", "chunk_id": "gdpr13_9", "claim_id": "gdpr13_9#3", "claim_text": "The nature of the personal data, including special categories or criminal convictions, is relevant to assessing compatibility.", "source_quote": "the nature of the personal data, in particular whether special categories of personal data are processed, pursuant to Article 9, or whether personal data related to criminal convictions and offences are processed, pursuant to Article 10;"}
{"doc": "gdpr13", "chunk_id": "gdpr13_9", "claim_id": "gdpr13_9#4", "claim_text": "The possible consequences for data subjects must be considered when evaluating compatibility.", "source_quote": "the possible consequences of the intended further processing for data subjects;"}
{"doc": "gdpr13", "chunk_id": "gdpr13_9", "claim_id": "gdpr13_9#5", "claim_text": "Appropriate safeguards, such as encryption or pseudonymisation, may be necessary to ensure compatibility.", "source_quote": "the existence of appropriate safeguards, which may include encryption or pseudonymisation"}
{"doc": "gdpr13", "chunk_id": "gdpr13_10", "claim_id": "gdpr13_10#1", "claim_text": "Processing of special categories of personal data shall be prohibited.", "source_quote": "Processing of special categories of personal data"}
{"doc": "gdpr13", "chunk_id": "gdpr13_10", "claim_id": "gdpr13_10#2", "claim_text": "The data subject has given explicit consent to the processing for one or more specified purposes.", "source_quote": "the data subject has given explicit consent"}
{"doc": "gdpr13", "chunk_id": "gdpr13_10", "claim_id": "gdpr13_10#3", "claim_text": "Processing is necessary for the purposes of carrying out obligations and exercising specific rights in the field of employment and social security and social protection law.", "source_quote": "processing is necessary for the purposes of carrying out obligations"}
{"doc": "gdpr13", "chunk_id": "gdpr13_10", "claim_id": "gdpr13_10#4", "claim_text": "The data subject is physically or legally incapable of giving consent.", "source_quote": "the data subject is physically or legally incapable of giving consent"}
{"doc": "gdpr13", "chunk_id": "gdpr13_10", "claim_id": "gdpr13_10#5", "claim_text": "Processing relates solely to members, former members, or persons in contact with it for its purposes.", "source_quote": "relates solely to members, former members, or persons in contact with it"}
{"doc": "gdpr13", "chunk_id": "gdpr13_10", "claim_id": "gdpr13_10#6", "claim_text": "The data subject has manifestly made personal data public.", "source_quote": "personal data manifestly made public by the data subject"}
{"doc": "gdpr13", "chunk_id": "gdpr13_10", "claim_id": "gdpr13_10#7", "claim_text": "Processing is necessary for establishment, exercise, or defence of legal claims.", "source_quote": "processing is necessary for establishment, exercise, or defence of legal claims"}
{"doc": "gdpr13", "chunk_id": "gdpr13_10", "claim_id": "gdpr13_10#8", "claim_text": "Courts act in their judicial capacity.", "source_quote": "whenever courts act in their judicial capacity"}
{"doc": "gdpr13", "chunk_id": "gdpr13_10", "claim_id": "gdpr13_10#9", "claim_text": "Processing is necessary for reasons of substantial public interest on the basis of Union or Member State law.", "source_quote": "processing is necessary for reasons of substantial public interest"}
{"doc": "gdpr13", "chunk_id": "gdpr13_10", "claim_id": "gdpr13_10#10", "claim_text": "Processing is necessary for preventive or occupational medicine, medical diagnosis, health or social care treatment, or management of health or social care systems and services.", "source_quote": "processing is necessary for preventive or occupational medicine"}
{"doc": "gdpr13", "chunk_id": "gdpr13_10", "claim_id": "gdpr13_10#11", "claim_text": "Processing is necessary for public interest in the area of public health.", "source_quote": "public interest in the area of public health"}
{"doc": "gdpr13", "chunk_id": "gdpr13_10", "claim_id": "gdpr13_10#12", "claim_text": "Processing is necessary for archiving purposes, scientific or historical research purposes, or statistical purposes based on Article 89(1).", "source_quote": "processing is necessary for archiving purposes"}
{"doc": "gdpr13", "chunk_id": "gdpr13_11", "claim_id": "gdpr13_11#1", "claim_text": "Processing of personal data which are manifestly made public by the data subject shall be lawful.", "source_quote": "manifestly made public by the data subject"}
{"doc": "gdpr13", "chunk_id": "gdpr13_11", "claim_id": "gdpr13_11#2", "claim_text": "Processing for the establishment, exercise or defence of legal claims or whenever courts are acting in their judicial capacity shall also be lawful.", "source_quote": "establishment, exercise or defence of legal claims or whenever courts are acting in their judicial capacity"}
{"doc": "gdpr13", "chunk_id": "gdpr13_11", "claim_id": "gdpr13_11#3", "claim_text": "Processing shall be lawful when necessary for reasons of substantial public interest on the basis of Union or Member State law that is proportionate to the aim pursued, respects the essence of the right to data protection and provides for suitable and specific measures to safeguard the fundamental rights and interests of the data subject.", "source_quote": "necessary for reasons of substantial public interest"}
{"doc": "gdpr13", "chunk_id": "gdpr13_12", "claim_id": "gdpr13_12#1", "claim_text": "The controller is not obliged to maintain, acquire or process additional information to identify a data subject if it does not require identification.", "source_quote": "shall not be obliged to maintain, acquire or process additional information in order to identify the data subject"}
{"doc": "gdpr13", "chunk_id": "gdpr13_12", "claim_id": "gdpr13_12#2", "claim_text": "If the controller cannot identify the data subject, it shall inform the data subject accordingly, if possible.", "source_quote": "the controller shall inform the data subject accordingly, if possible."}
{"doc": "gdpr13", "chunk_id": "gdpr13_12", "claim_id": "gdpr13_12#3", "claim_text": "Articles 15 to 20 do not apply unless the data subject provides additional information enabling their identification.", "source_quote": "shall not apply except where the data subject, for the purpose of exercising his or her rights under those articles, provides additional information enabling his or her identification"}
{"doc": "gdpr13", "chunk_id": "gdpr13_13", "claim_id": "gdpr13_13#1", "claim_text": "Processing of personal data relating to criminal convictions and offences or related security measures shall be carried out only under the control of official authority or when the processing is authorised by Union or Member State law.", "source_quote": "Processing of personal data relating to criminal convictions and offences or related security measures based on Article 6(1) shall be carried out only under the control of official authority or when the processing is authorised by Union or Member State law providing for appropriate safeguards for the rights and freedoms of data subjects."}
{"doc": "gdpr13", "chunk_id": "gdpr13_13", "claim_id": "gdpr13_13#2", "claim_text": "Any comprehensive register of criminal convictions shall be kept only under the control of official authority.", "source_quote": "Any comprehensive register of criminal convictions shall be kept only under the control of official authority."}
{"doc": "gdpr13", "chunk_id": "gdpr13_13", "claim_id": "gdpr13_13#3", "claim_text": "A controller is not obliged to maintain, acquire or process additional information in order to identify a data subject for the sole purpose of complying with the General Data Protection Regulation.", "source_quote": "If the purposes for which a controller processes personal data do not or no longer require the identification of a data subject by the controller, the controller shall not be obliged to maintain, acquire or process additional information in order to identify the data subject for the sole purpose of complying with the General Data Protection Regulation."}
{"doc": "gdpr13", "chunk_id": "gdpr13_13", "claim_id": "gdpr13_13#4", "claim_text": "A controller must inform a data subject if it is not possible to identify the data subject.", "source_quote": "Where, in cases referred to in paragraph 1, the controller is able to demonstrate that it is not in a position to identify the data subject, the controller shall inform the data subject accordingly, if possible."}
{"doc": "gdpr13", "chunk_id": "gdpr13_13", "claim_id": "gdpr13_13#5", "claim_text": "Articles 15 to 20 do not apply where a data subject cannot be identified.", "source_quote": "In such cases, Articles 15 to 20 shall not apply except where the data subject, for the purpose of exercising his or her rights under those articles, provides additional information enabling his or her identification."}
