{"doc": "amazon_sample", "chunk_id": "amazon_sample_1", "claim_id": "amazon_sample_1#1", "claim_text": "This passage is from Amazon.com, Inc.’s Form 10-K, specifically Item 1. Business.", "source_quote": "This passage is from Amazon.com, Inc.’s Form 10-K, specifically Item 1. Business."}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_1", "claim_id": "amazon_sample_1#2", "claim_text": "The annual report contains forward-looking statements based on expectations, estimates, and projections as of the date of the filing.", "source_quote": "This Annual Report on Form 10-K and the documents incorporated herein by reference contain forward-looking statements based on expectations, estimates, and projections as of the date of this filing."}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_1", "claim_id": "amazon_sample_1#3", "claim_text": "Actual results and outcomes may differ materially from those expressed in forward-looking statements.", "source_quote": "Actual results and outcomes may differ materially from those expressed in forward-looking statements."}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_1", "claim_id": "amazon_sample_1#4", "claim_text": "The terms \"Amazon.com,\" \"we,\" and \"our\" are defined within the context of the annual report.", "source_quote": "It defines the use of terms like “Amazon.com,” “we,” and “our” within the context of the annual report"}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_2", "claim_id": "amazon_sample_2#1", "claim_text": "“Amazon.com,” “we,” and “our” include Amazon.com, Inc. and its subsidiaries unless the context indicates otherwise.", "source_quote": "“herein, \"Amazon.com,\" \"we,\" \"our,\" and similar terms include Amazon.com, Inc. and its subsidiaries, unless the context indicates otherwise.”"}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_2", "claim_id": "amazon_sample_2#2", "claim_text": "The company seeks to be Earth’s most customer-centric company.", "source_quote": "General We seek to be Earth's most customer-centric company."}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_2", "claim_id": "amazon_sample_2#3", "claim_text": "The company is guided by four principles: customer obsession, passion for invention, commitment to operational excellence, and long-term thinking.", "source_quote": "We are guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking."}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_2", "claim_id": "amazon_sample_2#4", "claim_text": "The company serves its primary customer sets consisting of consumers and sellers.", "source_quote": "In each of our segments, we serve our primary customer sets, consisting of consumers, sellers,"}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_3", "claim_id": "amazon_sample_3#1", "claim_text": "The Company organizes its operations into three segments: North America, International, and Amazon Web Services (\"AWS\")", "source_quote": "These segments reflect the way the Company evaluates its business performance and manages its operations."}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_3", "claim_id": "amazon_sample_3#2", "claim_text": "The Company serves primary customer sets including consumers, sellers, developers, enterprises, content creators, advertisers, and employees.", "source_quote": "thinking. In each of our segments, we serve our primary customer sets, consisting of consumers, sellers, developers, enterprises, content creators, advertisers, and employees."}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_3", "claim_id": "amazon_sample_3#3", "claim_text": "Information on the Company’s net sales is located in Item 8 of Part II, \"Financial Statements and Supplementary Data - Note\"", "source_quote": "Information on our net sales is contained in Item 8 of Part II, \"Financial Statements and Supplementary Data - Note\""}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_4", "claim_id": "amazon_sample_4#1", "claim_text": "Amazon’s net sales are located in Item 8 of Part II, \"Financial Statements and Supplementary Data - Note 10 - Segment Information.\"", "source_quote": "our net sales is contained in Item 8 of Part II, \"Financial Statements and Supplementary Data - Note 10 - Segment Information.\""}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_4", "claim_id": "amazon_sample_4#2", "claim_text": "Amazon serves consumers through its online and physical stores.", "source_quote": "Consumers We serve consumers through our online and physical stores"}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_4", "claim_id": "amazon_sample_4#3", "claim_text": "Amazon’s stores enable the sale of hundreds of millions of unique products by Amazon and third parties.", "source_quote": "We design our stores to enable hundreds of millions of unique products to be sold by us and by third parties across dozens of product categories."}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_4", "claim_id": "amazon_sample_4#4", "claim_text": "Customers can access Amazon’s offerings through websites, mobile apps, Alexa, devices, streaming, and physical stores.", "source_quote": "Customers access our offerings through our websites, mobile apps, Alexa, devices, streaming, and physically visiting our stores."}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_5", "claim_id": "amazon_sample_5#1", "claim_text": "Amazon offers its customers products and services through websites, mobile apps, Alexa, devices, streaming, and physically visiting its stores.", "source_quote": "websites, mobile apps, Alexa, devices, streaming, and physically visiting our stores."}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_5", "claim_id": "amazon_sample_5#2", "claim_text": "Amazon manufactures and sells electronic devices, including Kindle, Fire tablet, Fire TV, Echo, Ring, Blink, and eero.", "source_quote": "We also manufacture and sell electronic devices, including Kindle, Fire tablet, Fire TV, Echo, Ring, Blink, and eero"}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_5", "claim_id": "amazon_sample_5#3", "claim_text": "Amazon offers subscription services such as Amazon Prime, which includes fast, free shipping.", "source_quote": "In addition, we offer subscription services such as Amazon Prime, a membership program that includes fast, free shipping on"}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_6", "claim_id": "amazon_sample_6#1", "claim_text": "Amazon offers subscription services, including Amazon Prime.", "source_quote": "addition, we offer subscription services such as Amazon Prime"}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_6", "claim_id": "amazon_sample_6#2", "claim_text": "Amazon Prime includes fast, free shipping on tens of millions of items.", "source_quote": "a membership program that includes fast, free shipping on tens of millions of items"}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_6", "claim_id": "amazon_sample_6#3", "claim_text": "Amazon fulfills customer orders through North America and International fulfillment networks.", "source_quote": "We fulfill customer orders in a number of ways, including through: North America and International fulfillment networks that we operate"}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_6", "claim_id": "amazon_sample_6#4", "claim_text": "Amazon utilizes co-sourced and outsourced arrangements in certain countries for fulfillment.", "source_quote": "We fulfill customer orders in a number of ways, including through: co-sourced and outsourced arrangements in certain countries"}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_6", "claim_id": "amazon_sample_6#5", "claim_text": "Amazon provides digital delivery of products and services.", "source_quote": "We fulfill customer orders in a number of ways, including through: digital delivery"}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_6", "claim_id": "amazon_sample_6#6", "claim_text": "Amazon operates customer service centers globally.", "source_quote": "We operate customer service centers globally"}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_7", "claim_id": "amazon_sample_7#1", "claim_text": "Amazon operates customer service centers globally.", "source_quote": "We operate customer service centers globally"}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_7", "claim_id": "amazon_sample_7#2", "claim_text": "Amazon earns fees from its seller programs.", "source_quote": "We earn fixed fees, a percentage of sales, per-unit activity fees, interest, or some combination thereof, for our seller programs."}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_7", "claim_id": "amazon_sample_7#3", "claim_text": "Amazon is not the seller of record in its seller programs.", "source_quote": "We are not the seller of record in these transactions."}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_8", "claim_id": "amazon_sample_8#1", "claim_text": "Amazon offers programs for developers and enterprises of all sizes.", "source_quote": "We serve developers and enterprises of all sizes, including start-ups, government agencies, and academic institutions"}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_8", "claim_id": "amazon_sample_8#2", "claim_text": "AWS provides a broad set of on-demand technology services.", "source_quote": "through AWS, which offers a broad set of on-demand technology services, including compute, storage, database, analytics, and machine learning"}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_8", "claim_id": "amazon_sample_8#3", "claim_text": "The company’s Form 10-K includes information about segment information in Item 8 of Part II.", "source_quote": "It details the company’s operational approach, outlining its three operating segments – North America, International, and Amazon Web Services (“AWS”), and references the location of financial information within the document, namely Item 8 of Part II, “Financial Statements and Supplementary Data - Note 10 - Segment Information.”"}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_9", "claim_id": "amazon_sample_9#1", "claim_text": "Amazon provides advertising services to sellers, publishers, authors, and others.", "source_quote": "We provide advertising services to sellers, vendors, publishers, authors, and others, through programs such as sponsored ads, display, and video advertising."}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_9", "claim_id": "amazon_sample_9#2", "claim_text": "Amazon’s business encompasses a large variety of product types, service offerings, and delivery channels.", "source_quote": "Our businesses encompass a large variety of product types, service offerings, and delivery channels."}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_9", "claim_id": "amazon_sample_9#3", "claim_text": "The worldwide marketplace in which Amazon competes is evolving rapidly and intensely competitive.", "source_quote": "The worldwide marketplace in which we compete is evolving rapidly and intensely competitive"}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_10", "claim_id": "amazon_sample_10#1", "claim_text": "The worldwide marketplace is evolving rapidly and intensely competitive.", "source_quote": "The worldwide marketplace in which we compete is evolving rapidly and intensely competitive"}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_10", "claim_id": "amazon_sample_10#2", "claim_text": "Amazon faces competitors from various industry sectors, including physical, e-commerce, and omnichannel retailers.", "source_quote": "Our current and potential competitors include: (1) physical, e-commerce, and omnichannel retailers"}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_10", "claim_id": "amazon_sample_10#3", "claim_text": "Amazon’s competitors include publishers, producers, and distributors of physical, digital, and interactive media.", "source_quote": "Our current and potential competitors include: (2) publishers, producers, and distributors of physical, digital, and interactive media of all types and all distribution"}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_11", "claim_id": "amazon_sample_11#1", "claim_text": "Web search engines, comparison shopping websites, and social networks are identified as channels for discovering and acquiring goods and services.", "source_quote": "web search engines, comparison shopping websites, social networks"}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_11", "claim_id": "amazon_sample_11#2", "claim_text": "Companies providing e-commerce services include website development and hosting.", "source_quote": "companies that provide e-commerce services, including website development and hosting"}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_11", "claim_id": "amazon_sample_11#3", "claim_text": "Omnichannel sales are a service provided by companies that offer e-commerce services.", "source_quote": "omnichannel sales"}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_12", "claim_id": "amazon_sample_12#1", "claim_text": "Amazon.com, Inc. faces competition from companies that provide fulfillment and logistics services.", "source_quote": "companies that provide fulfillment and logistics services for themselves or for third parties, whether online or offline;"}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_12", "claim_id": "amazon_sample_12#2", "claim_text": "Amazon.com, Inc. faces competition from companies that provide information technology services.", "source_quote": "companies that provide information technology services or products, including on-premises or cloud-based infrastructure and other services;"}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_12", "claim_id": "amazon_sample_12#3", "claim_text": "Amazon.com, Inc. faces competition from companies that design, manufacture, market, or sell consumer electronics.", "source_quote": "companies that design, manufacture, market, or sell consumer electronics, telecommunication, and electronic devices;"}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_13", "claim_id": "amazon_sample_13#1", "claim_text": "Amazon’s retail businesses prioritize selection, price, and convenience, including fast and reliable fulfillment.", "source_quote": "We believe that the principal competitive factors in our retail businesses include selection, price, and convenience, including fast and reliable fulfillment."}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_13", "claim_id": "amazon_sample_13#2", "claim_text": "Amazon’s seller and enterprise services depend on the quality, speed, and reliability of their services and tools.", "source_quote": "Additional competitive factors for our seller and enterprise services include the quality, speed, and reliability of our services and tools, as well as"}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_14", "claim_id": "amazon_sample_14#1", "claim_text": "Some of our current and potential competitors have greater resources.", "source_quote": "Some of our current and potential competitors have greater resources"}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_14", "claim_id": "amazon_sample_14#2", "claim_text": "Competitors may secure better terms from suppliers.", "source_quote": "They may secure better terms from suppliers"}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_14", "claim_id": "amazon_sample_14#3", "claim_text": "Competitors may adopt more aggressive pricing.", "source_quote": "They may secure better terms from suppliers, adopt more aggressive pricing"}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_14", "claim_id": "amazon_sample_14#4", "claim_text": "Competitors may pursue restrictive distribution agreements.", "source_quote": "They may secure better terms from suppliers, adopt more aggressive pricing, pursue restrictive distribution agreements that restrict our access to supply"}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_15", "claim_id": "amazon_sample_15#1", "claim_text": "Amazon faces competition that may attempt to restrict its access to supply.", "source_quote": "restrict our access to supply"}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_15", "claim_id": "amazon_sample_15#2", "claim_text": "Amazon’s competitors may direct consumers to their own offerings instead of Amazon’s.", "source_quote": "direct consumers to their own offerings instead of ours"}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_15", "claim_id": "amazon_sample_15#3", "claim_text": "Amazon’s competitors may lock in potential customers with restrictive terms.", "source_quote": "lock-in potential customers with restrictive terms"}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_15", "claim_id": "amazon_sample_15#4", "claim_text": "Amazon must devote more resources to technology, infrastructure, fulfillment, and marketing.", "source_quote": "devote more resources to technology, infrastructure, fulfillment, and marketing"}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_15", "claim_id": "amazon_sample_15#5", "claim_text": "The internet facilitates competitive entry and comparison shopping.", "source_quote": "internet facilitates competitive entry and comparison shopping"}
{"doc": "amazon_sample", "chunk_id": "amazon_sample_15", "claim_id": "amazon_sample_15#6", "claim_text": "New, smaller, or lesser-known businesses can compete against Amazon.", "source_quote": "which enhances the ability of new, smaller, or lesser-known businesses to compete against us"}
