[
  {
    "doc": "apple_sample",
    "id": "apple_sample_1",
    "chunk": "UNITED STATES SECURITIES AND EXCHANGE COMMISSION Washington, D.C. 20549 Apple Inc. FORM 10-K For the Fiscal Year Ended September 28, 2024 PART I Item 1. Business Company Background The Company designs, manufactures and markets smartphones, personal computers, tablets, wearables and accessories, and sells a variety of related services. The Company's fiscal year is the 52- or 53-week period that ends on the last Saturday of September. Products iPhone iPhone® is the"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_2",
    "chunk": "or 53-week period that ends on the last Saturday of September. Products iPhone iPhone® is the Company's line of smartphones based on its iOS operating system. The iPhone line includes iPhone 15 Pro, iPhone 15, iPhone 14, iPhone 13 and iPhone SE®. Mac Mac® is the Company's line of personal computers based on its macOS® operating system. The Mac line includes laptops MacBook Air® and MacBook Pro®, as well as desktops"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_3",
    "chunk": "Mac line includes laptops MacBook Air® and MacBook Pro®, as well as desktops iMac®, Mac mini®, Mac Studio® and Mac Pro®. iPad iPad® is the Company's line of multipurpose tablets based on its iPadOS® operating system. The iPad line includes iPad Pro®, iPad Air®, iPad and iPad mini®. Wearables, Home and Accessories Wearables includes smartwatches and wireless headphones. The Company's"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_4",
    "chunk": "Wearables, Home and Accessories Wearables includes smartwatches and wireless headphones. The Company's line of smartwatches, based on its watchOS® operating system, includes Apple Watch Ultra™ 2, Apple Watch® Series 9 and Apple Watch SE®. The Company's line of wireless headphones includes AirPods®, AirPods Pro®, AirPods Max™ and Beats® products. Home includes Apple TV®, the Company's media streaming and gaming device based"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_5",
    "chunk": "Beats® products. Home includes Apple TV®, the Company's media streaming and gaming device based on its tvOS® operating system, and HomePod® and HomePod mini®, high-fidelity wireless smart speakers. Accessories includes Apple-branded and third-party accessories. Apple Inc. | 2023 Form 10-K | 1 Services Advertising The Company's advertising services include third-party licensing arrangements and the Company's own advertising platforms. AppleCare The Company offers a portfolio of"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_6",
    "chunk": "third-party licensing arrangements and the Company's own advertising platforms. AppleCare The Company offers a portfolio of fee-based service and support products under the AppleCare® brand. The offerings provide priority access to Apple technical support, access to the global Apple authorized service network for repair and replacement services, and in many cases additional coverage for instances of accidental damage or theft and loss, depending on the country and type of product. Cloud Services The Company's cloud services store and keep customers' content"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_7",
    "chunk": "country and type of product. Cloud Services The Company's cloud services store and keep customers' content up-to-date and available across multiple Apple devices and Windows personal computers. Digital Content The Company operates various platforms, including the App Store®, that allow customers to discover and download applications and digital content, such as books, music, video, games and podcasts. The Company also offers digital content through subscription-based services, including Apple Arcade®, a game subscription service; Apple"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_8",
    "chunk": "offers digital content through subscription-based services, including Apple Arcade®, a game subscription service; Apple Fitness+SM, a personalized fitness service; Apple Music®, which offers users a curated listening experience with on-demand radio stations; Apple News+®, a subscription news and magazine service; and Apple TV+®, which offers exclusive original content and live sports. Payment Services The Company offers payment services, including Apple Card®, a co-branded credit card, and Apple Pay®,"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_9",
    "chunk": "payment services, including Apple Card®, a co-branded credit card, and Apple Pay®, a cashless payment service. Segments The Company manages its business primarily on a geographic basis. The Company's reportable segments consist of the Americas, Europe, Greater China, Japan and Rest of Asia Pacific. Americas includes both North and South America. Europe includes European countries, as well as India, the Middle East and Africa. Greater China includes China mainland, Hong Kong and Taiwan. Rest of Asia"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_10",
    "chunk": "the Middle East and Africa. Greater China includes China mainland, Hong Kong and Taiwan. Rest of Asia Pacific includes Australia and those Asian countries not included in the Company's other reportable segments. Although the reportable segments provide similar hardware and software products and similar services, each one is managed separately to better align with the location of the Company's customers and distribution partners and the unique market dynamics of each geographic region. Markets and Distribution The Company's customers are primarily in the consumer, small and"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_11",
    "chunk": "each geographic region. Markets and Distribution The Company's customers are primarily in the consumer, small and mid-sized business, education, enterprise and government markets. The Company sells its products and resells third-party products in most of its major markets directly to customers through its retail and online stores and its direct sales force. The Company also employs a variety of indirect distribution channels, such as third-party cellular network carriers, wholesalers, retailers and resellers. During 2023, the"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_12",
    "chunk": "third-party cellular network carriers, wholesalers, retailers and resellers. During 2023, the Company's net sales through its direct and indirect distribution channels accounted for 37% and 63%, respectively, of total net sales. Competition The markets for the Company's products and services are highly competitive, and are characterized by aggressive price competition and resulting downward pressure on gross margins, frequent introduction of new products and services, short product life cycles, evolving industry standards, continual improvement in product price"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_13",
    "chunk": "of new products and services, short product life cycles, evolving industry standards, continual improvement in product price and performance characteristics, rapid adoption of technological advancements by competitors, and price sensitivity on the part of consumers and businesses. Many of the Company's competitors seek to compete primarily through aggressive pricing and very low cost structures, and by imitating the Company's products and infringing on its intellectual property. Apple Inc. | 2023 Form 10-K | 2 The Company's ability to"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_14",
    "chunk": "property. Apple Inc. | 2023 Form 10-K | 2 The Company's ability to compete successfully depends heavily on ensuring the continuing and timely introduction of innovative new products, services and technologies to the marketplace. The Company designs and develops nearly the entire solution for its products, including the hardware, operating system, numerous software applications and related services. Principal competitive factors important to the Company include price, product and service features (including security features), relative price and performance, product and service quality and"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_15",
    "chunk": "product and service features (including security features), relative price and performance, product and service quality and reliability, design innovation, a strong third-party software and accessories ecosystem, marketing and distribution capability, service and support, and corporate reputation. The Company is focused on expanding its market opportunities related to smartphones, personal computers, tablets, wearables and accessories, and services. The Company faces substantial competition in these markets from companies that have significant technical, marketing, distribution and other resources, as well"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_16",
    "chunk": "competition in these markets from companies that have significant technical, marketing, distribution and other resources, as well as established hardware, software, and service offerings with large customer bases. In addition, some of the Company's competitors have broader product lines, lower-priced products and a larger installed base of active devices. Competition has been particularly intense as competitors have aggressively cut prices and lowered product margins. Certain competitors have the resources, experience or cost structures to provide products at little or no profit or even at a"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_17",
    "chunk": "have the resources, experience or cost structures to provide products at little or no profit or even at a loss. The Company's services compete with business models that provide content to users for free and use illegitimate means to obtain third-party digital content and applications. The Company faces significant competition as competitors imitate the Company's product features and applications within their products, or collaborate to offer integrated solutions that are more competitive than those they currently offer. Supply of Components Although most components essential to the"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_18",
    "chunk": "solutions that are more competitive than those they currently offer. Supply of Components Although most components essential to the Company's business are generally available from multiple sources, certain components are currently obtained from single or limited sources. The Company also competes for various components with other participants in the markets for smartphones, personal computers, tablets, wearables and accessories. Therefore, many components used by the Company, including those that are available from multiple sources, are at times subject to industry-wide shortage and significant commodity"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_19",
    "chunk": "those that are available from multiple sources, are at times subject to industry-wide shortage and significant commodity pricing fluctuations. The Company uses some custom components that are not commonly used by its competitors, and new products introduced by the Company often utilize custom components available from only one source. When a component or product uses new technologies, initial capacity constraints may exist until the suppliers' yields have matured or their manufacturing capacities have increased. The continued availability of these components at acceptable prices, or at all, may be"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_20",
    "chunk": "capacities have increased. The continued availability of these components at acceptable prices, or at all, may be affected if suppliers decide to concentrate on the production of common components instead of components customized to meet the Company's requirements. The Company has entered into agreements for the supply of many components; however, there can be no guarantee that the Company will be able to extend or renew these agreements on similar terms, or at all. Research and Development Because the industries in which the Company competes are characterized by rapid technological"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_21",
    "chunk": "or at all. Research and Development Because the industries in which the Company competes are characterized by rapid technological advances, the Company's ability to compete successfully depends heavily upon its ability to ensure a continual and timely flow of competitive products, services and technologies to the marketplace. The Company continues to develop new technologies to enhance existing products and services, and to expand the range of its offerings through research and development (\"R&D\"), licensing of intellectual property and acquisition of third-party businesses and"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_22",
    "chunk": "(\"R&D\"), licensing of intellectual property and acquisition of third-party businesses and technology. Intellectual Property The Company currently holds a broad collection of intellectual property rights relating to certain aspects of its hardware devices, accessories, software and services. This includes patents, designs, copyrights, trademarks and other forms of intellectual property rights in the U.S. and various foreign countries. Although the Company believes the ownership of such intellectual property rights is an important factor in differentiating its business and"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_23",
    "chunk": "the Company believes the ownership of such intellectual property rights is an important factor in differentiating its business and that its success does depend in part on such ownership, the Company relies primarily on the innovative skills, technical competence and marketing abilities of its personnel. The Company regularly files patent, design, copyright and trademark applications to protect innovations arising from its research, development, design and marketing, and is currently pursuing thousands of applications around the world. Over time, the Company has accumulated a large portfolio of issued and registered"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_24",
    "chunk": "of applications around the world. Over time, the Company has accumulated a large portfolio of issued and registered intellectual property rights around the world. No single intellectual property right is solely responsible for protecting the Company's products and services. The Company believes the duration of its intellectual property rights is adequate relative to the expected lives of its products and services. In addition to Company-owned intellectual property, many of the Company's products and services are designed to include intellectual property owned by third parties. It may be"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_25",
    "chunk": "Company's products and services are designed to include intellectual property owned by third parties. It may be necessary in the future to seek or renew licenses relating to various aspects of the Company's products, processes and services. While the Company has generally been able to obtain such licenses on commercially reasonable terms in the past, there is no guarantee that such licenses could be obtained in the future on reasonable terms or at all. Apple Inc. | 2023 Form 10-K | 3 Business Seasonality and Product"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_26",
    "chunk": "at all. Apple Inc. | 2023 Form 10-K | 3 Business Seasonality and Product Introductions The Company has historically experienced higher net sales in its first quarter compared to other quarters in its fiscal year due in part to seasonal holiday demand. Additionally, new product and service introductions can significantly impact net sales, cost of sales and operating expenses. The timing of product introductions can also impact the Company's net sales to its indirect distribution channels as these channels are filled with new inventory following a product"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_27",
    "chunk": "Company's net sales to its indirect distribution channels as these channels are filled with new inventory following a product launch, and channel inventory of an older product often declines as the launch of a newer product approaches. Net sales can also be affected when consumers and distributors anticipate a product introduction. Human Capital The Company believes it has a talented, motivated and dedicated team, and works to create an inclusive, safe and supportive environment for all of its team members. As of September 30, 2023, the"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_28",
    "chunk": "safe and supportive environment for all of its team members. As of September 30, 2023, the Company had approximately 161,000 full-time equivalent employees. Workplace Practices and Policies The Company is an equal opportunity employer committed to inclusion and diversity and to providing a workplace free of harassment or discrimination. Compensation and Benefits The Company believes that compensation should be competitive and equitable, and should enable employees to share in the Company's success. The Company recognizes its people are most likely to thrive when they have"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_29",
    "chunk": "in the Company's success. The Company recognizes its people are most likely to thrive when they have the resources to meet their needs and the time and support to succeed in their professional and personal lives. In support of this, the Company offers a wide variety of benefits for employees around the world and invests in tools and resources that are designed to support employees' individual growth and development. Inclusion and Diversity The Company is committed to its vision to build and sustain a more inclusive workforce that is representative of the"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_30",
    "chunk": "The Company is committed to its vision to build and sustain a more inclusive workforce that is representative of the communities it serves. The Company continues to work to increase diverse representation at every level, foster an inclusive culture, and support equitable pay and access to opportunity for all employees. Engagement The Company believes that open and honest communication among team members, managers and leaders helps create an open, collaborative work environment where everyone can contribute, grow and succeed. Team members are encouraged to come to their managers with questions,"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_31",
    "chunk": "everyone can contribute, grow and succeed. Team members are encouraged to come to their managers with questions, feedback or concerns, and the Company conducts surveys that gauge employee sentiment in areas like career development, manager performance and inclusivity. Health and Safety The Company is committed to protecting its team members everywhere it operates. The Company identifies potential workplace risks in order to develop measures to mitigate possible hazards. The Company supports employees with general safety, security and crisis management training, and by putting specific programs in place"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_32",
    "chunk": "Company supports employees with general safety, security and crisis management training, and by putting specific programs in place for those working in potentially high-hazard environments. Additionally, the Company works to protect the safety and security of its team members, visitors and customers through its global security team. Available Information The Company's Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and amendments to reports filed pursuant to Sections 13(a) and"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_33",
    "chunk": "Reports on Form 8-K, and amendments to reports filed pursuant to Sections 13(a) and 15(d) of the Securities Exchange Act of 1934, as amended (the \"Exchange Act\"), are filed with the U.S. Securities and Exchange Commission (the \"SEC\"). Such reports and other information filed by the Company with the SEC are available free of charge at investor.apple.com/investor-relations/sec-filings/default.aspx when"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_34",
    "chunk": "investor.apple.com/investor-relations/sec-filings/default.aspx when such reports are available on the SEC's website. The Company periodically provides certain information for investors on its corporate website, www.apple.com, and its investor relations website, investor.apple.com. This includes press releases and other information about financial performance, information on environmental, social and governance matters, and details related to the Company's annual meeting of shareholders. The information contained on"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_35",
    "chunk": "governance matters, and details related to the Company's annual meeting of shareholders. The information contained on the websites referenced in this Form 10-K is not incorporated by reference into this filing. Further, the Company's references to website URLs are intended to be inactive textual references only. Apple Inc. | 2023 Form 10-K | 4 Item 1A. Risk Factors The Company's business, reputation, results of operations, financial condition and stock price can be affected by a number of"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_36",
    "chunk": "business, reputation, results of operations, financial condition and stock price can be affected by a number of factors, whether currently known or unknown, including those described below. When any one or more of these risks materialize from time to time, the Company's business, reputation, results of operations, financial condition and stock price can be materially and adversely affected. Because of the following factors, as well as other factors affecting the Company's results of operations and financial condition, past financial performance"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_37",
    "chunk": "as well as other factors affecting the Company's results of operations and financial condition, past financial performance should not be considered to be a reliable indicator of future performance, and investors should not use historical trends to anticipate results or trends in future periods. This discussion of risk factors contains forward-looking statements. This section should be read in conjunction with Part II, Item 7, \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" and the consolidated financial statements and accompanying notes in"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_38",
    "chunk": "Discussion and Analysis of Financial Condition and Results of Operations\" and the consolidated financial statements and accompanying notes in Part II, Item 8, \"Financial Statements and Supplementary Data\" of this Form 10-K. Macroeconomic and Industry Risks The Company's operations and performance depend significantly on global and regional economic conditions and adverse economic conditions can materially adversely affect the Company's business, results of operations and financial condition. The Company has international operations with sales outside the U.S. representing a majority of"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_39",
    "chunk": "financial condition. The Company has international operations with sales outside the U.S. representing a majority of the Company's total net sales. In addition, the Company's global supply chain is large and complex and a majority of the Company's supplier facilities, including manufacturing and assembly sites, are located outside the U.S. As a result, the Company's operations and performance depend significantly on global and regional economic conditions. Adverse macroeconomic conditions, including slow growth or recession, high"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_40",
    "chunk": "significantly on global and regional economic conditions. Adverse macroeconomic conditions, including slow growth or recession, high unemployment, inflation, tighter credit, higher interest rates, and currency fluctuations, can adversely impact consumer confidence and spending and materially adversely affect demand for the Company's products and services. In addition, consumer confidence and spending can be materially adversely affected in response to changes in fiscal and monetary policy, financial market volatility, declines in income or asset values, and other economic"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_41",
    "chunk": "and monetary policy, financial market volatility, declines in income or asset values, and other economic factors. In addition to an adverse impact on demand for the Company's products and services, uncertainty about, or a decline in, global or regional economic conditions can have a significant impact on the Company's suppliers, contract manufacturers, logistics providers, distributors, cellular network carriers and other channel partners, and developers. Potential outcomes include financial instability; inability to obtain credit to finance business operations; and"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_42",
    "chunk": "partners, and developers. Potential outcomes include financial instability; inability to obtain credit to finance business operations; and insolvency. Adverse economic conditions can also lead to increased credit and collectibility risk on the Company's trade receivables; the failure of derivative counterparties and other financial institutions; limitations on the Company's ability to issue new debt; reduced liquidity; and declines in the fair values of the Company's financial instruments. These and other impacts can materially adversely"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_43",
    "chunk": "the fair values of the Company's financial instruments. These and other impacts can materially adversely affect the Company's business, results of operations, financial condition and stock price. The Company's business can be impacted by political events, trade and other international disputes, war, terrorism, natural disasters, public health issues, industrial accidents and other business interruptions. Political events, trade and other international disputes, war, terrorism, natural disasters, public health issues, industrial accidents and other business"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_44",
    "chunk": "other international disputes, war, terrorism, natural disasters, public health issues, industrial accidents and other business interruptions can harm or disrupt international commerce and the global economy, and could have a material adverse effect on the Company and its customers, suppliers, contract manufacturers, logistics providers, distributors, cellular network carriers and other channel partners. Apple Inc. | 2023 Form 10-K | 5 The Company has a large, global business with sales outside the U.S. representing a majority of the"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_45",
    "chunk": "Company has a large, global business with sales outside the U.S. representing a majority of the Company's total net sales, and the Company believes that it generally benefits from growth in international trade. Substantially all of the Company's manufacturing is performed in whole or in part by outsourcing partners located primarily in China mainland, India, Japan, South Korea, Taiwan and Vietnam. Restrictions on international trade, such as tariffs and other controls on imports or exports of goods, technology or data,"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_46",
    "chunk": "international trade, such as tariffs and other controls on imports or exports of goods, technology or data, can materially adversely affect the Company's operations and supply chain and limit the Company's ability to offer and distribute its products and services to customers. The impact can be particularly significant if these restrictive measures apply to countries and regions where the Company derives a significant portion of its revenues and/or has significant supply chain operations. Restrictive measures can require the Company to take various actions, including changing"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_47",
    "chunk": "and/or has significant supply chain operations. Restrictive measures can require the Company to take various actions, including changing suppliers, restructuring business relationships, and ceasing to offer third-party applications on its platforms. Changing the Company's operations in accordance with new or changed restrictions on international trade can be expensive, time-consuming and disruptive to the Company's operations. Such restrictions can be announced with little or no advance notice and the Company may not be able to effectively mitigate all adverse impacts"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_48",
    "chunk": "with little or no advance notice and the Company may not be able to effectively mitigate all adverse impacts from such measures. For example, tensions between governments, including the U.S. and China, have in the past led to tariffs and other restrictions being imposed on the Company's business. If disputes and conflicts further escalate in the future, actions by governments in response could be significantly more severe and restrictive and could materially adversely affect the Company's business. Political uncertainty surrounding trade"
  },
  {
    "doc": "apple_sample",
    "id": "apple_sample_49",
    "chunk": "severe and restrictive and could materially adversely affect the Company's business. Political uncertainty surrounding trade and other international disputes could also have a negative effect on consumer confidence and spending, which could adversely affect the"
  }
]