{
  "doc_id": "gdpr",
  "passage_id": "d23b5953fd19c8ab95df8da3b6de219a",
  "claim": "The free movement of personal data within the Union shall be neither restricted nor prohibited for reasons connected with the protection of natural persons with regard to the processing of personal data."
}
{
  "doc_id": "gdpr",
  "passage_id": "d23b5953fd19c8ab95df8da3b6de219a",
  "claim": "This Regulation applies to the processing of personal data wholly or partly by automated means and to the processing other than by automated means of personal data which form part of a filing system or are intended to form part of a filing system."
}
{
  "doc_id": "gdpr",
  "passage_id": "e4e2204d5436cbc04e5ab681380976d5",
  "claim": "This Regulation applies to the processing of personal data in the context of the activities of an establishment of a controller or a processor in the Union, regardless of whether the processing takes place in the Union or not."
}
{
  "doc_id": "gdpr",
  "passage_id": "e4e2204d5436cbc04e5ab681380976d5",
  "claim": "This Regulation applies to the processing of personal data by a controller not established in the Union, but in a place where Member State law applies by virtue of public international law."
}
{
  "doc_id": "gdpr",
  "passage_id": "cd360510d0f9081dc6453ee893200d53",
  "claim": "CHAPTER II Principles Article 5 Principles relating to processing of personal data 1."
}
{
  "doc_id": "gdpr",
  "passage_id": "1f81c52b0a20d2f66d214d5c9ec58af8",
  "claim": "The controller shall be responsible for, and be able to demonstrate compliance with, paragraph 1 (‘accountability’)."
}
{
  "doc_id": "gdpr",
  "passage_id": "b9c09a046d52e1b70dd54b671a987b66",
  "claim": "Point (f) of the first subparagraph shall not apply to processing carried out by public authorities in the performance of their tasks."
}
{
  "doc_id": "gdpr",
  "passage_id": "b9c09a046d52e1b70dd54b671a987b66",
  "claim": "The basis for the processing referred to in point (c) and (e) of paragraph 1 shall be laid down by: (a) Union law; or (b) Member State law to which the controller is subject."
}
{
  "doc_id": "gdpr",
  "passage_id": "6f545bd19ef2c00cabffd28c9147fb82",
  "claim": "The purpose of the processing shall be determined in that legal basis or, as regards the processing referred to in point (e) of paragraph 1, shall be necessary for the performance of a task carried out in the public interest or in the exercise of official authority vested in the controller."
}
{
  "doc_id": "gdpr",
  "passage_id": "6f545bd19ef2c00cabffd28c9147fb82",
  "claim": "The Union or the Member State law shall meet an objective of public interest and be proportionate to the legitimate aim pursued."
}
{
  "doc_id": "gdpr",
  "passage_id": "276602125c216a8af730321aad052884",
  "claim": "Where processing is based on consent, the controller shall be able to demonstrate that the data subject has consented to processing of his or her personal data."
}
{
  "doc_id": "gdpr",
  "passage_id": "276602125c216a8af730321aad052884",
  "claim": "If the data subject's consent is given in the context of a written declaration which also concerns other matters, the request for consent shall be presented in a manner which is clearly distinguishable from the other matters, in an intelligible and easily accessible form, using clear and plain language."
}
{
  "doc_id": "gdpr",
  "passage_id": "f5228e81d3560ad689023041bb33e34d",
  "claim": "Paragraph 1 shall not affect the general contract law of Member States such as the rules on the validity, formation or effect of a contract in relation to a child."
}
{
  "doc_id": "gdpr",
  "passage_id": "f5228e81d3560ad689023041bb33e34d",
  "claim": "Processing of personal data revealing racial or ethnic origin, political opinions, religious or philosophical beliefs, or trade union membership, and the processing of genetic data, biometric data for the purpose of uniquely identifying a natural person, data concerning health or data concerning a natural person's sex life or sexual orientation shall be prohibited."
}
{
  "doc_id": "gdpr",
  "passage_id": "4d175d5dcb0128bb4e67260aec8c1d9b",
  "claim": "Member States may maintain or introduce further conditions, including limitations, with regard to the processing of genetic data, biometric data or data concerning health."
}
{
  "doc_id": "gdpr",
  "passage_id": "7a49007e62be2dbf1e34d626af29399d",
  "claim": "Any comprehensive register of criminal convictions shall be kept only under the control of official authority."
}
{
  "doc_id": "gdpr",
  "passage_id": "b744fabe935792805d309f2c150929ea",
  "claim": "In such cases, Articles 15 to 20 shall not apply except where the data subject, for the purpose of exercising his or her rights under those articles, provides additional information enabling his or her identification."
}
{
  "doc_id": "gdpr",
  "passage_id": "b744fabe935792805d309f2c150929ea",
  "claim": "CHAPTER III Rights of the data subject Section 1 Transparency and modalities Article 12 Transparent information, communication and modalities for the exercise of the rights of the data subject 1."
}
{
  "doc_id": "gdpr",
  "passage_id": "c1ad8461e55a9663b021c533ff4040c4",
  "claim": "That period may be extended by two further months where necessary, taking into account the complexity and number of the requests."
}
{
  "doc_id": "gdpr",
  "passage_id": "c1ad8461e55a9663b021c533ff4040c4",
  "claim": "The controller shall inform the data subject of any such extension within one month of receipt of the request, together with the reasons for the delay."
}
{
  "doc_id": "gdpr",
  "passage_id": "d29f944f14f0b772371f64b0f24c8375",
  "claim": "Information and access to personal data Article 13 Information to be provided where personal data are collected from the data subject 1."
}
{
  "doc_id": "gdpr",
  "passage_id": "b970d3c3d3c506be4385feca2296a94e",
  "claim": "Where the controller intends to further process the personal data for a purpose other than that for which the personal data were collected, the controller shall provide the data subject prior to that further processing with information on that other purpose and with any relevant further information as referred to in paragraph 2."
}
{
  "doc_id": "gdpr",
  "passage_id": "b970d3c3d3c506be4385feca2296a94e",
  "claim": "Paragraphs 1, 2 and 3 shall not apply where and insofar as the data subject already has the information."
}
{
  "doc_id": "gdpr",
  "passage_id": "d302351e190c922f486f682ebb3a54f8",
  "claim": "Where the controller intends to further process the personal data for a purpose other than that for which the personal data were obtained, the controller shall provide the data subject prior to that further processing with information on that other purpose and with any relevant further information as referred to in paragraph 2."
}
{
  "doc_id": "gdpr",
  "passage_id": "005c98dbd9f660246213bbf275569ebc",
  "claim": "Where personal data are transferred to a third country or to an international organisation, the data subject shall have the right to be informed of the appropriate safeguards pursuant to Article 46 relating to the transfer."
}
{
  "doc_id": "gdpr",
  "passage_id": "005c98dbd9f660246213bbf275569ebc",
  "claim": "The controller shall provide a copy of the personal data undergoing processing."
}
{
  "doc_id": "gdpr",
  "passage_id": "7aa1d197f3478040fd23e0fe4589d3a4",
  "claim": "Taking into account the purposes of the processing, the data subject shall have the right to have incomplete personal data completed, including by means of providing a supplementary statement."
}
{
  "doc_id": "gdpr",
  "passage_id": "91c5e224bcea7ec857c4b9a6d0eb919c",
  "claim": "A data subject who has obtained restriction of processing pursuant to paragraph 1 shall be informed by the controller before the restriction of processing is lifted."
}
{
  "doc_id": "gdpr",
  "passage_id": "45dacef384b35935a1b16c234c95070b",
  "claim": "The controller shall inform the data subject about those recipients if the data subject requests it."
}
{
  "doc_id": "gdpr",
  "passage_id": "243fe2730fb5108b3ca16eee75edf4c8",
  "claim": "The data subject shall have the right to object, on grounds relating to his or her particular situation, at any time to processing of personal data concerning him or her which is based on point (e) or (f) of Article 6(1), including profiling based on those provisions."
}
{
  "doc_id": "gdpr",
  "passage_id": "243fe2730fb5108b3ca16eee75edf4c8",
  "claim": "The controller shall no longer process the personal data unless the controller demonstrates compelling legitimate grounds for the processing which override the interests, rights and freedoms of the data subject or for the establishment, exercise or defence of legal claims."
}
