{"doc": "plato", "chunk_id": "plato_1", "claim_id": "plato_1#1", "claim_text": "Socrates is the narrator of the dialogue.", "source_quote": "BOOK I PERSONS OF THE DIALOGUE. Socrates, who is the narrator."}
{"doc": "plato", "chunk_id": "plato_1", "claim_id": "plato_1#2", "claim_text": "The scene is set in the house of Cephalus at the Piraeus.", "source_quote": "The scene is laid in the house of Cephalus at the Piraeus;"}
{"doc": "plato", "chunk_id": "plato_1", "claim_id": "plato_1#3", "claim_text": "Socrates went to the Piraeus with Glaucon to offer prayers to the goddess Bendis.", "source_quote": "I went down yesterday to the Piraeus with Glaucon the son of Ariston, that I might offer up my prayers to the goddess (Bendis, the Thracian Artemis.);"}
{"doc": "plato", "chunk_id": "plato_1", "claim_id": "plato_1#4", "claim_text": "Polemarchus is the son of Cephalus.", "source_quote": "Polemarchus the son of Cephalus chanced to catch sight of us from a distance as we were starting on our way home,"}
{"doc": "plato", "chunk_id": "plato_2", "claim_id": "plato_2#1", "claim_text": "Polemarchus desires you to wait.", "source_quote": "The servant took hold of me by the cloak behind, and said: Polemarchus desires you to wait."}
{"doc": "plato", "chunk_id": "plato_2", "claim_id": "plato_2#2", "claim_text": "Socrates and Glaucon are already on their way to the city.", "source_quote": "I perceive, Socrates, that you and your companion are already on your way to the city."}
{"doc": "plato", "chunk_id": "plato_2", "claim_id": "plato_2#3", "claim_text": "The group consists of multiple people.", "source_quote": "But do you see, he rejoined, how many we are?"}
{"doc": "plato", "chunk_id": "plato_2", "claim_id": "plato_2#4", "claim_text": "Socrates is not stronger than all these people.", "source_quote": "And are you stronger than all these? for if not, you will have to remain where you are."}
{"doc": "plato", "chunk_id": "plato_2", "claim_id": "plato_2#5", "claim_text": "The group refuses to listen to Socrates' persuasion.", "source_quote": "Then we are not going to listen; of that you may be assured."}
{"doc": "plato", "chunk_id": "plato_2", "claim_id": "plato_2#6", "claim_text": "A torch-race on horseback will take place in the evening.", "source_quote": "Has no one told you of the torch-race on horseback in honour of the goddess which will take place in the evening?"}
{"doc": "plato", "chunk_id": "plato_3", "claim_id": "plato_3#1", "claim_text": "A festival will be celebrated at night.", "source_quote": "a festival will be celebrated at night"}
{"doc": "plato", "chunk_id": "plato_3", "claim_id": "plato_3#2", "claim_text": "There will be a gathering of young men.", "source_quote": "a gathering of young men"}
{"doc": "plato", "chunk_id": "plato_4", "claim_id": "plato_4#1", "claim_text": "Socrates is invited to visit Cephalus more often.", "source_quote": "You don't come to see me, Socrates, as often as you ought"}
{"doc": "plato", "chunk_id": "plato_4", "claim_id": "plato_4#2", "claim_text": "Cephalus invites Socrates to keep company with his friends at the Piraeus.", "source_quote": "make our house your resort and keep company with these young men"}
{"doc": "plato", "chunk_id": "plato_4", "claim_id": "plato_4#3", "claim_text": "Socrates prefers conversing with aged men.", "source_quote": "There is nothing which for my part I like better, Cephalus, than conversing with aged men"}
{"doc": "plato", "chunk_id": "plato_4", "claim_id": "plato_4#4", "claim_text": "Cephalus has reached the 'threshold of old age'.", "source_quote": "I have arrived at that time which the poets call the 'threshold of old age'"}
{"doc": "plato", "chunk_id": "plato_5", "claim_id": "plato_5#1", "claim_text": "Old age is not necessarily accompanied by complaints about physical decline.", "source_quote": "But to me, Socrates, these complainers seem to blame that which is not really in fault."}
{"doc": "plato", "chunk_id": "plato_5", "claim_id": "plato_5#2", "claim_text": "Cephalus and others of his age group often complain about their declining physical abilities.", "source_quote": "Men of my age flock together; we are birds of a feather, as the old proverb says; and at our meetings the tale of my acquaintance commonly is -I cannot eat, I cannot drink; the pleasures of youth and love are fled away: there was a good time once, but now that is gone, and life is no longer life."}
{"doc": "plato", "chunk_id": "plato_5", "claim_id": "plato_5#3", "claim_text": "Sophocles, an aged poet, has escaped the troubles of youth.", "source_quote": "His words"}
{"doc": "plato", "chunk_id": "plato_6", "claim_id": "plato_6#1", "claim_text": "Old age is characterized by a sense of calm and freedom.", "source_quote": "For certainly old age has a great sense of calm and freedom;"}
{"doc": "plato", "chunk_id": "plato_6", "claim_id": "plato_6#2", "claim_text": "The passions relax their hold in old age, freeing individuals from the grasp of many masters.", "source_quote": "then, as Sophocles says, we are freed from the grasp not of one mad master only, but of many."}
{"doc": "plato", "chunk_id": "plato_6", "claim_id": "plato_6#3", "claim_text": "Regrets and complaints about relations can be attributed to an individual's character rather than old age.", "source_quote": "The truth is, Socrates, that these regrets, and also the complaints about relations, are to be attributed to the same cause, which is not old age, but men's characters and tempers;"}
{"doc": "plato", "chunk_id": "plato_6", "claim_id": "plato_6#4", "claim_text": "Wealth can provide comfort in old age.", "source_quote": "You are right, he replied; they are not convinced: and there is something in what they say; not"}
{"doc": "plato", "chunk_id": "plato_7", "claim_id": "plato_7#1", "claim_text": "Wealth is well known to be a great comforter.", "source_quote": "you are rich, and wealth is well known to be a great comforter."}
{"doc": "plato", "chunk_id": "plato_7", "claim_id": "plato_7#2", "claim_text": "Old age cannot be a light burden for the good poor man.", "source_quote": "to the good poor man old age cannot be a light burden"}
{"doc": "plato", "chunk_id": "plato_7", "claim_id": "plato_7#3", "claim_text": "A bad rich man can never have peace with himself.", "source_quote": "a bad rich man ever have peace with himself"}
{"doc": "plato", "chunk_id": "plato_7", "claim_id": "plato_7#4", "claim_text": "Cephalus' fortune was acquired through making money.", "source_quote": "Acquired! Socrates; do you want to know how much I acquired? In the art of making money I have been midway between my father and grandfather:"}
{"doc": "plato", "chunk_id": "plato_8", "claim_id": "plato_8#1", "claim_text": "Wealth is a characteristic of those who have inherited their fortunes.", "source_quote": "which is a characteristic rather of those who have inherited their fortunes"}
{"doc": "plato", "chunk_id": "plato_8", "claim_id": "plato_8#2", "claim_text": "Those who have acquired their wealth have a second love for money as a creation of their own.", "source_quote": "the makers of fortunes have a second love of money as a creation of their own"}
{"doc": "plato", "chunk_id": "plato_8", "claim_id": "plato_8#3", "claim_text": "People who are near death are tormented by the thought that their deeds may be punished after they die.", "source_quote": "when a man thinks himself to be near death, fears and cares enter into his mind which he never had before; the tales of a world below and the punishment which is exacted there of deeds done here were once a laughing matter to him, but now he is tormented with the thought that they may be true"}
{"doc": "plato", "chunk_id": "plato_9", "claim_id": "plato_9#1", "claim_text": "Old age can be accompanied by a clearer view of one's past transgressions.", "source_quote": "either from the weakness of age, or because he is now drawing nearer to that other place, he has a clearer view of these things;"}
{"doc": "plato", "chunk_id": "plato_9", "claim_id": "plato_9#2", "claim_text": "A person who is conscious of no sin can experience sweet hope in old age.", "source_quote": "'Hope,' he says, 'cherishes the soul of him who lives in justice and holiness, and is the nurse of his age and the companion of his journey;-"}
{"doc": "plato", "chunk_id": "plato_9", "claim_id": "plato_9#3", "claim_text": "A good man with no occasion to deceive or defraud others can depart to the afterlife without apprehension.", "source_quote": "and when he departs to the world below he is not in any apprehension about offerings due to the gods or debts which he owes to men."}
{"doc": "plato", "chunk_id": "plato_10", "claim_id": "plato_10#1", "claim_text": "Wealth contributes to a person's peace of mind.", "source_quote": "Now to this peace of mind the possession of wealth greatly contributes;"}
{"doc": "plato", "chunk_id": "plato_10", "claim_id": "plato_10#2", "claim_text": "Paying one's debts is part of justice.", "source_quote": "to pay your debts-no more than this?"}
{"doc": "plato", "chunk_id": "plato_10", "claim_id": "plato_10#3", "claim_text": "Speaking the truth is part of justice.", "source_quote": "to speak the truth and to pay your debts-no more than this?"}
{"doc": "plato", "chunk_id": "plato_11", "claim_id": "plato_11#1", "claim_text": "Simonides defined justice as the repayment of a debt.", "source_quote": "He said that the repayment of a debt is just,"}
{"doc": "plato", "chunk_id": "plato_11", "claim_id": "plato_11#2", "claim_text": "The return of a deposit does not necessarily involve justice.", "source_quote": "he certainly does not mean, as we were just now saying, that I ought to return a deposit of arms or of anything else to one who asks for it when he is not in his right senses;"}
{"doc": "plato", "chunk_id": "plato_11", "claim_id": "plato_11#3", "claim_text": "Justice may not always require doing good to friends.", "source_quote": "he thinks that a friend ought always to do good to a friend and never evil."}
{"doc": "plato", "chunk_id": "plato_12", "claim_id": "plato_12#1", "claim_text": "Simonides' definition of justice involves repaying debts.", "source_quote": "Simonides said that the repayment of a debt was justice"}
{"doc": "plato", "chunk_id": "plato_12", "claim_id": "plato_12#2", "claim_text": "Justice gives good to friends and evil to enemies.", "source_quote": "he thinks that a friend ought always to do good to a friend and never evil. And are enemies also to receive what we owe to them?"}
{"doc": "plato", "chunk_id": "plato_12", "claim_id": "plato_12#3", "claim_text": "Medicine gives drugs, meat, and drink to human bodies.", "source_quote": "He would surely reply that medicine gives drugs and meat and drink to human bodies"}
{"doc": "plato", "chunk_id": "plato_12", "claim_id": "plato_12#4", "claim_text": "Cookery gives seasoning to food.", "source_quote": "And what is that which justice gives, and to whom? If, Socrates, we are talking about cookery, it gives seasoning to food."}
{"doc": "plato", "chunk_id": "plato_13", "claim_id": "plato_13#1", "claim_text": "Justice gives good to friends.", "source_quote": "If, Socrates, we are to be guided at all by the analogy of the preceding instances, then justice is the art which gives good to friends and evil to enemies."}
{"doc": "plato", "chunk_id": "plato_13", "claim_id": "plato_13#2", "claim_text": "Justice gives evil to enemies.", "source_quote": "then justice is the art which gives good to friends and evil to enemies"}
{"doc": "plato", "chunk_id": "plato_13", "claim_id": "plato_13#3", "claim_text": "The physician can do good to his friends and evil to his enemies in time of sickness.", "source_quote": "And who is best able to do good to his friends and evil to his enemies in time of sickness? The physician."}
{"doc": "plato", "chunk_id": "plato_13", "claim_id": "plato_13#4", "claim_text": "The pilot can do good to his friends and evil to his enemies amid the perils of the sea.", "source_quote": "Or when they are on a voyage, amid the perils of the sea? The pilot."}
{"doc": "plato", "chunk_id": "plato_13", "claim_id": "plato_13#5", "claim_text": "The just man is most able to do harm to his enemy and good to his friend in going to war or making alliances.", "source_quote": "And in what sort of actions or with a view to what result is the just man most able to do harm to his enemy and good to his friend? In going to war against the one and in making alliances with the other."}
{"doc": "plato", "chunk_id": "plato_13", "claim_id": "plato_13#6", "claim_text": "Justice can be used in time of peace.", "source_quote": "Then in time of peace justice will be of no use? I am very far from thinking so."}
{"doc": "plato", "chunk_id": "plato_14", "claim_id": "plato_14#1", "claim_text": "Justice is useful in contracts.", "source_quote": "In contracts, Socrates, justice is of use."}
{"doc": "plato", "chunk_id": "plato_14", "claim_id": "plato_14#2", "claim_text": "The just man is a better partner in a money partnership than the harp-player.", "source_quote": "In a money partnership. Yes, Polemarchus, but surely not in the use of money; for you do not want a"}
